# 7주차 과제
- 60171100 윤민혁

## 단톡방 과제 1

In [2]:
import re

In [3]:
pattern = re.compile(' vs. ')
splited = pattern.split('Spider man vs. Super man')
splited2 = pattern.split('Iron man vs. Ultron')
print(splited)
print(splited2)

['Spider man', 'Super man']
['Iron man', 'Ultron']

## 단톡방 과제 2

In [4]:
account1 = 'KB 231401-04-296081'
account2 = 'NH 301-0173-716502'

pat = re.compile('[^0-9]')
print(pat.sub('',account1))
print(pat.sub('',account2))

23140104296081
3010173716502

# 7주차 개인톡 과제
- 60171100 윤민혁

## 과제 1
- 학번에서 입학년도만 **으로 변경하기 (정규 표현식 사용)

In [5]:
import re

In [6]:
student_number = '''
60191234
60163456
'''
pat = re.compile('(\d{2})(\d{2})(\d{4})')
print(pat.sub('\g<1>**\g<3>',student_number))

60**1234
60**3456

## 7주차 개인톡 과제 2
- 60171100 윤민혁
- 비번인증 만들기(대문자, 소문자, 숫자, 특수기호(#, @, &) 각각 하나 이상 포함, 전체 8글자 이상 13자리 미만)

In [7]:
passward = (input('숫자를 입력하시오: '))
pat1 = re.compile('[A-Z]')
pat2 = re.compile('[a-z]')
pat3 = re.compile('[0-9]')
pat4 = re.compile('[#@&]')
if (len(passward) >= 8) & (len(passward) < 13):
    if  pat1.findall(passward) and pat2.findall(passward) and pat3.findall(passward) and pat4.findall(passward):
        print('적합')
    else:
        print('부적합')
else:
    print('부적합')

숫자를 입력하시오: wefkjs
부적합

## 7주차 개인톡 과제 3
- 60171100 윤민혁
- Mr은 남성, Miss는 미혼여성, Mrs는 기혼여성 나머지는 기타로 분류

In [8]:
import pandas as pd
import numpy as np

In [9]:
df = pd.read_csv('./data/train (1).csv')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [10]:
df = df.drop(df[['Pclass','Sex','Age','SibSp','Parch','Ticket','Fare','Cabin','Embarked']], axis= 1)
df.tail(20)

     PassengerId  Survived                                              Name
871          872         1  Beckwith, Mrs. Richard Leonard (Sallie Monypeny)
872          873         0                          Carlsson, Mr. Frans Olof
873          874         0                       Vander Cruyssen, Mr. Victor
874          875         1             Abelson, Mrs. Samuel (Hannah Wizosky)
875          876         1                  Najib, Miss. Adele Kiamie "Jane"
876          877         0                     Gustafsson, Mr. Alfred Ossian
877          878         0                              Petroff, Mr. Nedelio
878          879         0                                Laleff, Mr. Kristo
879          880         1     Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)
880          881         1      Shelley, Mrs. William (Imanita Parrish Hall)
881          882         0                                Markun, Mr. Johann
882          883         0                      Dahlberg, Miss. Gerda Ulrika
883          884         0                     Banfield, Mr. Frederick James
884          885         0                            Sutehall, Mr. Henry Jr
885          886         0              Rice, Mrs. William (Margaret Norton)
886          887         0                             Montvila, Rev. Juozas
887          888         1                      Graham, Miss. Margaret Edith
888          889         0          Johnston, Miss. Catherine Helen "Carrie"
889          890         1                             Behr, Mr. Karl Howell
890          891         0                               Dooley, Mr. Patrick

In [11]:
pat = re.compile(' [A-Za-z]+\.')
title = []
for item in range(len(df)):
    a = pat.findall(df['Name'][item])
    title.append(a)

In [12]:
np.unique(title)

C:\Users\alsgu\anaconda3\lib\site-packages\numpy\lib\arraysetops.py:270: VisibleDeprecationWarning: Creating an ndarray from ragged nested sequences (which is a list-or-tuple of lists-or-tuples-or ndarrays with different lengths or shapes) is deprecated. If you meant to do this, you must specify 'dtype=object' when creating the ndarray.
  ar = np.asanyarray(ar)

array([list([' Capt.']), list([' Col.']), list([' Countess.']),
       list([' Don.']), list([' Dr.']), list([' Jonkheer.']),
       list([' Lady.']), list([' Major.']), list([' Master.']),
       list([' Miss.']), list([' Mlle.']), list([' Mme.']),
       list([' Mr.']), list([' Mrs.']), list([' Mrs.', ' L.']),
       list([' Ms.']), list([' Rev.']), list([' Sir.'])], dtype=object)

In [13]:
title2 = [i[0] for i in title]
np.unique(title2)

array([' Capt.', ' Col.', ' Countess.', ' Don.', ' Dr.', ' Jonkheer.',
       ' Lady.', ' Major.', ' Master.', ' Miss.', ' Mlle.', ' Mme.',
       ' Mr.', ' Mrs.', ' Ms.', ' Rev.', ' Sir.'], dtype='<U10')

In [14]:
b=[]
for i in range(len(title2)):
    if title2[i] == " Mr.":
        b.append(pat.sub('남성', title2[i]))
    elif title2[i] == ' Miss.':
        b.append(pat.sub('미혼여성', title2[i]))
    elif title2[i] == ' Mrs.':
        b.append(pat.sub('기혼여성', title2[i]))
    else:
        b.append(pat.sub('기타', title2[i]))

In [15]:
df['title'] = b

In [16]:
df

,PassengerId,Survived,Name,title
0,1,0,"Braund, Mr. Owen Harris",남성
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",기혼여성
2,3,1,"Heikkinen, Miss. Laina",미혼여성
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",기혼여성
4,5,0,"Allen, Mr. William Henry",남성
...,...,...,...,...
886,887,0,"Montvila, Rev. Juozas",기타
887,888,1,"Graham, Miss. Margaret Edith",미혼여성
888,889,0,"Johnston, Miss. Catherine Helen ""Carrie""",미혼여성
889,890,1,"Behr, Mr. Karl Howell",남성
890,891,0,"Dooley, Mr. Patrick",남성

In [17]:
total = df.groupby(['title'])[['Survived']].count()
total

       Survived
title
기타           67
기혼여성        125
남성          517
미혼여성        182

In [23]:
df2 = df.groupby(['title'])[['Survived']].sum()
df2

       Survived
title
기타           35
기혼여성         99
남성           81
미혼여성        127

In [25]:
final =  df2/total
final

       Survived
title
기타     0.522388
기혼여성   0.792000
남성     0.156673
미혼여성   0.697802